{"batchcomplete":"",
"name": "vishnu",
"query":{"normalized":[{"from":"Mark_Zuckerberg","to":"Mark Zuckerberg"}],
"pages":{"2844938":{"pageid":2844938,"ns":0,"title":"Mark Zuckerberg","extract":"<p><b>Mark Elliot Zuckerberg</b> (born May 14, 1984) is an American computer programmer and Internet entrepreneur. He is best known as one of five co-founders of the social networking website Facebook. Zuckerberg was made the chairman and chief executive of Facebook, Inc. in April 2013. and his personal wealth, as of March 2015, is estimated to be $35.1 billion. Mark Zuckerberg receives a one-dollar salary as CEO of Facebook.</p>\n<p>Together with his college roommates and fellow Harvard University students Eduardo Saverin, Andrew McCollum, Dustin Moskovitz, and Chris Hughes, Zuckerberg launched Facebook from Harvard's dormitory rooms. The group then introduced Facebook onto other campuses nationwide and moved to Palo Alto, California shortly afterwards. In 2007, at the age of 23, Zuckerberg became a billionaire as a result of Facebook's success. The number of Facebook users worldwide reached a total of one billion in 2012. Zuckerberg was involved in various legal disputes that were initiated by others in the group, who claimed a share of the company based upon their involvement during the development phase of Facebook.</p>\n<p>Since 2010, <i>Time</i> magazine has named Zuckerberg among the 100 wealthiest and most influential people in the world as a part of its Person of the Year distinction. In 2011, Zuckerberg ranked first on the list of the \"Most Influential Jews in the World\" by <i>The Jerusalem Post</i>. Zuckerberg was played by actor Jesse Eisenberg in the 2010 film <i>The Social Network</i>, in which the rise of Facebook is portrayed.</p>\n\n<h2>§<span id=\"Early_life\">Early life</span></h2>\n<p>Zuckerberg was born in 1984 in White Plains, New York. He is the son of dentist Edward Zuckerberg and psychiatrist Karen Kempner. He and his three sisters, Randi, Donna, and Arielle, were brought up in Dobbs Ferry, New York, a small Westchester County town about 10 miles north of New York City. Zuckerberg was raised Jewish and had his bar mitzvah when he turned 13. Afterward, he became an atheist.</p>\n<p>At Ardsley High School, Zuckerberg excelled in classics. He transferred to Phillips Exeter Academy in his junior year, where he won prizes in science (math, astronomy and physics) and classical studies. On his college application, Zuckerberg claimed that he could read and write French, Hebrew, Latin, and ancient Greek. He was captain of the fencing team. In college, he was known for reciting lines from epic poems such as <i>The Iliad</i>.</p>\n<h2>§<span id=\"Software_developer\">Software developer</span></h2>\n<h3>§<span id=\"Early_years\">Early years</span></h3>\n<p>Zuckerberg began using computers and writing software in middle school. His father taught him Atari BASIC Programming in the 1990s, and later hired software developer David Newman to tutor him privately. Newman calls him a \"prodigy\", adding that it was \"tough to stay ahead of him\". Zuckerberg took a graduate course in the subject at Mercy College near his home while still in high school. He enjoyed developing computer programs, especially communication tools and games. In one such program, since his father's dental practice was operated from their home, he built a software program he called \"ZuckNet\" that allowed all the computers between the house and dental office to communicate with each other. It is considered a \"primitive\" version of AOL's Instant Messenger, which came out the following year.</p>\n<p>According to writer Jose Antonio Vargas, \"some kids played computer games. Mark created them.\" Zuckerberg himself recalls this period: \"I had a bunch of friends who were artists. They'd come over, draw stuff, and I'd build a game out of it.\" However, notes Vargas, Zuckerberg was not a typical \"geek-klutz\", as he later became captain of his prep school fencing team and earned a classics diploma. Napster co-founder Sean Parker, a close friend, notes that Zuckerberg was \"really into Greek odysseys and all that stuff\", recalling how he once quoted lines from the Roman epic poem <i>Aeneid</i>, by Virgil, during a Facebook product conference.</p>\n<p>During Zuckerberg's high school years, under the company name Intelligent Media Group, he built a music player called the Synapse Media Player that used machine learning to learn the user's listening habits, which was posted to Slashdot and received a rating of 3 out of 5 from <i>PC Magazine</i>.</p>\n<h3>§<span id=\"College_years\">College years</span></h3>\n<p>By the time he began classes at Harvard, Zuckerberg had already achieved a \"reputation as a programming prodigy\", notes Vargas. He studied psychology and computer science as well as belonging to Alpha Epsilon Pi, a Jewish fraternity, and Kirkland House. In his sophomore year, he wrote a program he called CourseMatch, which allowed users to make class selection decisions based on the choices of other students and also to help them form study groups. A short time later, he created a different program he initially called Facemash that let students select the best looking person from a choice of photos. According to Zuckerberg's roommate at the time, Arie Hasit, \"he built the site for fun\". Hasit explains:</p>\n<blockquote>\n<p>We had books called Face Books, which included the names and pictures of everyone who lived in the student dorms. At first, he built a site and placed two pictures, or pictures of two males and two females. Visitors to the site had to choose who was \"hotter\" and according to the votes there would be a ranking.</p>\n</blockquote>\n<p>The site went up over a weekend; but by Monday morning, the college shut it down because its popularity had overwhelmed one of Harvard's network switches and prevented students from accessing the Internet. In addition, many students complained that their photos were being used without permission. Zuckerberg apologized publicly, and the student paper ran articles stating that his site was \"completely improper.\"</p>\n<p>The following semester, in January 2004, Zuckerberg began writing code for a new website. On February 4, 2004, Zuckerberg launched \"Thefacebook\", originally located at thefacebook.com.</p>\n<p>Six days after the site launched, three Harvard seniors, Cameron Winklevoss, Tyler Winklevoss, and Divya Narendra, accused Zuckerberg of intentionally misleading them into believing he would help them build a social network called HarvardConnection.com, while he was instead using their ideas to build a competing product. The three complained to the <i>Harvard Crimson</i> and the newspaper began an investigation in response.</p>\n<p>Following the official launch of the Facebook social media platform, the three filed a lawsuit against Zuckerberg that resulted in a settlement. The agreed settlement was for 1.2 million Facebook shares that were worth US$300 million at Facebook's IPO.</p>\n<p>Zuckerberg dropped out of Harvard in his sophomore year to complete his project. In January 2014, Zuckerberg recalled:</p>\n<blockquote>\n<p>I remember really vividly, you know, having pizza with my friends a day or two after—I opened up the first version of Facebook at the time I thought, \"You know, someone needs to build a service like this for the world.\" But I just never thought that we'd be the ones to help do it. And I think a lot of what it comes down to is we just cared more.</p>\n</blockquote>\n<h2>§<span id=\"Career\">Career</span></h2>\n\n<h3>§<span id=\"Facebook\">Facebook</span></h3>\n\n<p>Zuckerberg launched Facebook from his Harvard dormitory room on February 4, 2004. An earlier inspiration for Facebook may have come from Phillips Exeter Academy, the prep school from which Zuckerberg graduated in 2002. It published its own student directory, “The Photo Address Book,” which students referred to as “The Facebook.” Such photo directories were an important part of the student social experience at many private schools. With them, students were able to list attributes such as their class years, their friends, and their telephone numbers.</p>\n<p>Once at college, Zuckerberg's Facebook started off as just a \"Harvard thing\" until Zuckerberg decided to spread it to other schools, enlisting the help of roommate Dustin Moskovitz. They began with Columbia, New York University, Stanford, Dartmouth, Cornell, Penn, Brown, and Yale. Samyr Laine, a triple jumper representing Haiti at the 2012 Summer Olympics, shared a room with Zuckerberg during Facebook's founding. \"Mark was clearly on to great things,\" said Laine, who was Facebook's fourteenth user.</p>\n<p>After Zuckerberg moved to Palo Alto, California with Moskovitz and some friends, they leased a small house that served as an office. Over the summer, Zuckerberg met Peter Thiel who invested in the company. They got their first office in mid-2004. According to Zuckerberg, the group planned to return to Harvard but eventually decided to remain in California. They had already turned down offers by major corporations to buy the company. In an interview in 2007, Zuckerberg explained his reasoning: \"It's not because of the amount of money. For me and my colleagues, the most important thing is that we create an open information flow for people. Having media corporations owned by conglomerates is just not an attractive idea to me.\"</p>\n<p>He restated these goals to <i>Wired</i> magazine in 2010: \"The thing I really care about is the mission, making the world open.\" Earlier, in April 2009, Zuckerberg sought the advice of former Netscape CFO Peter Currie about financing strategies for Facebook. On July 21, 2010, Zuckerberg reported that the company reached the 500 million-user mark. When asked whether Facebook could earn more income from advertising as a result of its phenomenal growth, he explained:</p>\n<blockquote>\n<p>I guess we could..... If you look at how much of our page is taken up with ads compared to the average search query. The average for us is a little less than 10 percent of the pages and the average for search is about 20 percent taken up with ads..... That's the simplest thing we could do. But we aren't like that. We make enough money. Right, I mean, we are keeping things running; we are growing at the rate we want to.</p>\n</blockquote>\n<p>In 2010, Steven Levy, who wrote the 1984 book <i>Hackers: Heroes of the Computer Revolution</i>, wrote that Zuckerberg \"clearly thinks of himself as a hacker\". Zuckerberg said that \"it's OK to break things\" \"to make them better\". Facebook instituted \"hackathons\" held every six to eight weeks where participants would have one night to conceive of and complete a project. The company provided music, food, and beer at the hackathons, and many Facebook staff members, including Zuckerberg, regularly attended. \"The idea is that you can build something really good in a night\", Zuckerberg told Levy. \"And that's part of the personality of Facebook now..... It's definitely very core to my personality.\"</p>\n<p><i>Vanity Fair</i> magazine named Zuckerberg number 1 on its 2010 list of the Top 100 \"most influential people of the Information Age\". Zuckerberg ranked number 23 on the <i>Vanity Fair</i> 100 list in 2009. In 2010, Zuckerberg was chosen as number 16 in <i>New Statesman'</i>s annual survey of the world's 50 most influential figures.</p>\n<p>In a 2011 interview with PBS after the death of Steve Jobs, Zuckerberg said that Jobs had advised him on how to create a management team at Facebook that was \"focused on building as high quality and good things as you are\".</p>\n<p>On October 1, 2012, Zuckerberg visited Russian Prime Minister Dmitry Medvedev in Moscow to stimulate social media innovation in Russia and to boost Facebook's position in the Russian market. Russia's communications minister tweeted that Prime Minister Dmitry Medvedev urged the social media giant's founder to abandon plans to lure away Russian programmers and instead consider opening a research center in Moscow. In 2012, Facebook had roughly 9 million users in Russia, while domestic clone VK had around 34 million. Rebecca Van Dyck, Facebook's head of consumer marketing, claimed that 85 million American Facebook users were exposed to the first day of the Home promotional campaign on April 6, 2013.</p>\n<p>On August 19, 2013, the <i>Washington Post</i> reported that Zuckerberg's Facebook profile was hacked by an unemployed web developer.</p>\n<p>At the 2013 TechCrunch Disrupt conference, held in September, Zuckerberg stated that he is working towards registering the 5 billion humans who were not connected to the Internet as of the conference on Facebook. Zuckerberg then explained that this is intertwined with the aim of the Internet.org project, whereby Facebook, with the support of other technology companies, seeks to increase the number of people connected to the internet.</p>\n<p>Zuckerberg was the keynote speaker at the 2014 Mobile World Congress (MWC), held in Barcelona, Spain, in March 2014, which was attended by 75,000 delegates. Various media sources highlighted the connection between Facebook's focus on mobile technology and Zuckerberg's speech, claiming that mobile represents the future of the company. Zuckerberg's speech expands upon the goal that he raised at the TechCrunch conference in September 2013, whereby he is working towards expanding Internet coverage into developing countries.</p>\n<p>Alongside other American technology figures like Jeff Bezos and Tim Cook, Zuckerberg hosted visiting Chinese politician Lu Wei, known as the \"Internet czar\" for his influence in the enforcement of China's online policy, at Facebook's headquarters on December 8, 2014. The meeting occurred after Zuckerberg participated in a Q&amp;A session at Tsinghua University in Beijing, China, on October 23, 2014, where he attempted to converse in Mandarin Chinese—although Facebook is banned in China, Zuckerberg is highly regarded among the people and was at the university to help fuel the nation's burgeoning entrepreneur sector.</p>\n<p>Zuckerberg fielded questions during a live Q&amp;A session at the company's headquarters in Menlo Park on December 11, 2014. The founder and CEO explained that he does not believe Facebook is a waste of time because it facilitates social engagement, and participating in a public session was so that he could \"learn how to better serve the community\".</p>\n<h3>§<span id=\"Wirehog\">Wirehog</span></h3>\n\n<p>A month after Facebook launched in February 2004, i2hub, another campus-only service, created by Wayne Chang, was launched. i2hub focused on peer-to-peer file sharing. At the time, both i2hub and Facebook were gaining the attention of the press and growing rapidly in users and publicity. In August 2004, Zuckerberg, Andrew McCollum, Adam D'Angelo, and Sean Parker launched a competing peer-to-peer file sharing service called Wirehog, a precursor to Facebook Platform applications.</p>\n<h3>§<span id=\"Platform.2C_Beacon_and_Connect\">Platform, Beacon and Connect</span></h3>\n\n<p>On May 24, 2007, Zuckerberg announced Facebook Platform, a development platform for programmers to create social applications within Facebook. Within weeks, many applications had been built and some already had millions of users. It grew to more than 800,000 developers around the world building applications for Facebook Platform.</p>\n<p>On November 6, 2007, Zuckerberg announced Beacon, a social advertising system that enabled people to share information with their Facebook friends based on their browsing activities on other sites. For example, eBay sellers could let friends know automatically what they have for sale via the Facebook news feed as they listed items for sale. The program came under scrutiny because of privacy concerns from groups and individual users. Zuckerberg and Facebook failed to respond to the concerns quickly, and on December 5, 2007, Zuckerberg wrote a blog post on Facebook, taking responsibility for the concerns about Beacon and offering an easier way for users to opt out of the service.</p>\n<p>In 2007, Zuckerberg was named by the Massachusetts Institute of Technology (MIT) Technology Review's TR35 as one of the top 35 innovators in the world under the age of 35. On July 23, 2008, Zuckerberg announced Facebook Connect, a version of Facebook Platform for users.</p>\n<h3>§<span id=\"Internet.org\">Internet.org</span></h3>\n<p>In a public Facebook post, Zuckerberg launched the Internet.org project in late August 2013. Zuckerberg explained that the primary aim of the initiative is to provide Internet access to the 5 billion people who are not connected as of the launch date. Using a three-tier strategy, Internet.org will also create new jobs and open up new markets, according to Zuckerberg. He stated in his post:</p>\n<blockquote>\n<p>The world economy is going through a massive transition right now. The knowledge economy is the future. By bringing everyone online, we'll not only improve billions of lives, but we'll also improve our own as we benefit from the ideas and productivity they contribute to the world. Giving everyone the opportunity to connect is the foundation for enabling the knowledge economy. It is not the only thing we need to do, but it's a fundamental and necessary step.</p>\n</blockquote>\n<h3>§<span id=\"Legal_controversies\">Legal controversies</span></h3>\n\n<h4>§<span id=\"ConnectU_lawsuits\">ConnectU lawsuits</span></h4>\n\n<p>Harvard students Cameron Winklevoss, Tyler Winklevoss, and Divya Narendra accused Zuckerberg of intentionally making them believe he would help them build a social network called HarvardConnection.com (later called ConnectU). They filed a lawsuit in 2004, but it was dismissed on a technicality on March 28, 2007. It was refiled soon thereafter in federal court in Boston. Facebook countersued in regards to Social Butterfly, a project put out by The Winklevoss Chang Group, an alleged partnership between ConnectU and i2hub. On June 25, 2008, the case settled and Facebook agreed to transfer over 1.2 million common shares and pay $20 million in cash.</p>\n<p>In November 2007, confidential court documents were posted on the website of <i>02138</i>, a magazine that catered to Harvard alumni. They included Zuckerberg's social security number, his parents' home address, and his girlfriend's address. Facebook filed to have the documents removed, but the judge ruled in favor of <i>02138</i>.</p>\n<h4>§<span id=\"Saverin_lawsuit\">Saverin lawsuit</span></h4>\n<p>A lawsuit filed by Eduardo Saverin against Facebook and Zuckerberg was settled out of court. Though terms of the settlement were sealed, the company affirmed Saverin's title as co-founder of Facebook. Saverin signed a non-disclosure contract after the settlement.</p>\n<h4>§<span id=\"Pakistan_criminal_investigation\">Pakistan criminal investigation</span></h4>\n<p>In June 2010, Pakistani Deputy Attorney General Muhammad Azhar Sidiqque launched a criminal investigation into Zuckerberg and Facebook co-founders Dustin Moskovitz and Chris Hughes after a \"Draw Muhammad\" contest was hosted on Facebook. The investigation named the anonymous German woman who created the contest. Sidiqque asked the country's police to contact Interpol to have Zuckerberg and the three others arrested for blasphemy. On May 19, 2010, Facebook's website was temporarily blocked in Pakistan until Facebook removed the contest from its website at the end of May. Sidiqque also asked its UN representative to raise the issue with the United Nations General Assembly.</p>\n<h4>§<span id=\"Paul_Ceglia\">Paul Ceglia</span></h4>\n\n<p>In June 2010, Paul Ceglia, the owner of a wood pellet fuel company in Allegany County, upstate New York, filed suit against Zuckerberg, claiming 84% ownership of Facebook and seeking monetary damages. According to Ceglia, he and Zuckerberg signed a contract on April 28, 2003, that an initial fee of $1,000 entitled Ceglia to 50% of the website's revenue, as well as an additional 1% interest in the business per day after January 1, 2004, until website completion. Zuckerberg was developing other projects at the time, among which was <i>Facemash</i>, the predecessor of Facebook, but did not register the domain name <i>thefacebook.com</i> until January 1, 2004. Facebook management dismissed the lawsuit as \"completely frivolous\". Facebook spokesman Barry Schnitt told a reporter that Ceglia's counsel had unsuccessfully sought an out-of-court settlement.</p>\n<p>On October 26, 2012, federal authorities arrested Ceglia, charging him with mail and wire fraud and of \"tampering with, destroying and fabricating evidence in a scheme to defraud the Facebook founder of billions of dollars.\" Ceglia is accused of fabricating emails to make it appear that he and Zuckerberg discussed details about an early version of Facebook, although after examining their emails, investigators found there was no mention of Facebook in them. Some law firms withdrew from the case before it was initiated and others after Ceglia's arrest.</p>\n<h2>§<span id=\"Depictions_in_media\">Depictions in media</span></h2>\n<h3>§<span id=\"The_Social_Network\"><i>The Social Network</i></span></h3>\n\n<p>A movie based on Zuckerberg and the founding years of Facebook, <i>The Social Network</i> was released on October 1, 2010, and stars Jesse Eisenberg as Zuckerberg. After Zuckerberg was told about the film, he responded, \"I just wished that nobody made a movie of me while I was still alive.\" Also, after the film's script was leaked on the Internet and it was apparent that the film would not portray Zuckerberg in a wholly positive light, he stated that he wanted to establish himself as a \"good guy\". The film is based on the book <i>The Accidental Billionaires</i> by Ben Mezrich, which the book's publicist once described as \"big juicy fun\" rather than \"reportage\". The film's screenwriter Aaron Sorkin told <i>New York</i> magazine, \"I don't want my fidelity to be the truth; I want it to be storytelling\", adding, \"What is the big deal about accuracy purely for accuracy's sake, and can we not have the true be the enemy of the good?\"</p>\n<p>Upon winning the Golden Globes award for Best Picture on January 16, 2011, producer Scott Rudin thanked Facebook and Zuckerberg \"for his willingness to allow us to use his life and work as a metaphor through which to tell a story about communication and the way we relate to each other.” Sorkin, who won for Best Screenplay, retracted some of the impressions given in his script:</p>\n<dl><dd>\"I wanted to say to Mark Zuckerberg tonight, if you're watching, Rooney Mara's character makes a prediction at the beginning of the movie. She was wrong. You turned out to be a great entrepreneur, a visionary, and an incredible altruist.\"</dd>\n</dl><p>On January 29, 2011, Zuckerberg made a surprise guest appearance on <i>Saturday Night Live</i>, which was being hosted by Jesse Eisenberg. They both said it was the first time they ever met. Eisenberg asked Zuckerberg, who had been critical of his portrayal by the film, what he thought of the movie. Zuckerberg replied, \"It was interesting.\" In a subsequent interview about their meeting, Eisenberg explains that he was \"nervous to meet him, because I had spent now, a year and a half thinking about him ...\" He adds, \"Mark has been so gracious about something that’s really so uncomfortable ... The fact that he would do <i>SNL</i> and make fun of the situation is so sweet and so generous. It’s the best possible way to handle something that, I think, could otherwise be very uncomfortable.\"</p>\n<h4>§<span id=\"Disputed_accuracy\">Disputed accuracy</span></h4>\n<p>Jeff Jarvis, author of the book <i>Public Parts</i>, interviewed Zuckerberg and believes Sorkin made up too much of the story. He states, \"That's what the internet is accused of doing, making stuff up, not caring about the facts.\"</p>\n<p>According to David Kirkpatrick, former technology editor at <i>Fortune</i> magazine and author of <i>The Facebook Effect:The Inside Story of the Company That Is Connecting the World,</i> (2011), \"the film is only \"40% true ... he is not snide and sarcastic in a cruel way, the way Zuckerberg is played in the movie.\" He says that \"a lot of the factual incidents are accurate, but many are distorted and the overall impression is false\", and concludes that primarily \"his motivations were to try and come up with a new way to share information on the internet\".</p>\n<p>Although the film portrays Zuckerberg's creation of Facebook in order to elevate his stature after not getting into any of the elite final clubs at Harvard, Zuckerberg himself said he had no interest in joining the clubs. Kirkpatrick agrees that the impression implied by the film is \"false\". Karel Baloun, a former senior engineer at Facebook, notes that the \"image of Zuckerberg as a socially inept nerd is overstated..... It is fiction.....\" He likewise dismisses the film's assertion that he \"would deliberately betray a friend\".</p>\n<h3>§<span id=\"Other_depictions\">Other depictions</span></h3>\n<p>Zuckerberg voiced himself on an episode of <i>The Simpsons</i> titled \"Loan-a Lisa\", which first aired on October 3, 2010. In the episode, Lisa Simpson and her friend Nelson encounter Zuckerberg at an entrepreneurs' convention. Zuckerberg tells Lisa that she does not need to graduate from college to be wildly successful, referencing Bill Gates and Richard Branson as examples.</p>\n<p>On October 9, 2010, <i>Saturday Night Live</i> lampooned Zuckerberg and Facebook. Andy Samberg played Zuckerberg. The real Zuckerberg was reported to have been amused: \"I thought this was funny.\"</p>\n<p>Stephen Colbert awarded a \"Medal of Fear\" to Zuckerberg at the Rally to Restore Sanity and/or Fear on October 30, 2010, \"because he values his privacy much more than he values yours\".</p>\n<h2>§<span id=\"Use_of_other_social_networks\">Use of other social networks</span></h2>\n<p>Zuckerberg created an account with Google+ soon after the social network was unveiled, saying he sees it as a \"validation for his vision\" of online social networking. By July 2011, Zuckerberg had become the most followed user on Google+, outranking Google co-founders Larry Page and Sergey Brin. As of March 6, 2012, his ranking has dropped to 184 on the service, behind Page and Brin. His public profile is minimal with one photo and a bio that reads \"I make things\".</p>\n<p>Zuckerberg has maintained a private account on Twitter under the username \"zuck\", although as of November 2014, the account's status is suspended. In 2009, he revealed that the public account \"finkd\" also belonged to him.</p>\n<h2>§<span id=\"Philanthropy\">Philanthropy</span></h2>\n<p>Zuckerberg donated an undisclosed amount to Diaspora, an open-source personal web server that implements a distributed social networking service. He called it a \"cool idea\".</p>\n<p>Zuckerberg founded the Start-up: Education foundation. On September 22, 2010, it was reported that Zuckerberg had donated $100million to Newark Public Schools, the public school system of Newark, New Jersey. Critics noted the timing of the donation as being close to the release of <i>The Social Network</i>, which painted a somewhat negative portrait of Zuckerberg. Zuckerberg responded to the criticism, saying, \"The thing that I was most sensitive about with the movie timing was, I didn't want the press about <i>The Social Network</i> movie to get conflated with the Newark project. I was thinking about doing this anonymously just so that the two things could be kept separate.\" Newark Mayor Cory A. Booker stated that he and New Jersey Governor Chris Christie had to convince Zuckerberg's team not to make the donation anonymously.</p>\n<p>On December 9, 2010, Zuckerberg, Bill Gates, and investor Warren Buffett signed a promise they called \"The Giving Pledge \", in which they promised to donate to charity at least half of their wealth over the course of time, and invited others among the wealthy to donate 50% or more of their wealth to charity.</p>\n<p>On December 19, 2013, Zuckerberg announced a donation of 18 million Facebook shares to the Silicon Valley Community Foundation, to be executed by the end of the month—based on Facebook's valuation as of then, the shares totaled $990 million in value. On December 31, 2013, the donation was recognized as the largest charitable gift on public record for 2013. <i>The Chronicle of Philanthropy</i> reported on February 10, 2014 that Zuckerberg's donation was the largest charitable gift on the public record in 2013 and put Zuckerberg and his wife at the top of the magazine's annual list of 50 most generous Americans in 2013, having donated roughly 1 billion dollars to charity.</p>\n<p>In October 2014, Zuckerberg and his wife Priscilla Chan donated $25 million to combat the ebola virus disease, specifically the ebola virus epidemic in West Africa.</p>\n<h2>§<span id=\"Politics\">Politics</span></h2>\n<p>In 2002, Zuckerberg registered to vote in Westchester County, New York, where he grew up, but did not cast a ballot until November 2008. Santa Clara County Registrar of Voters Spokeswoman, Elma Rosas, told Bloomberg that Zuckerberg is listed as “no preference” on voter rolls, and he voted in the past two general elections, in 2008 and 2012. On Zuckerberg's Facebook page, he has Chris Christie, Cory Booker, Nicolas Sarkozy, and Barack Obama in his likes section.</p>\n<p>Mark Zuckerberg has never specified his own political views: some consider him a conservative, while others consider him liberal. In 2013, numerous liberal and progressive groups, such as The League of Conservation Voters, MoveOn.org, the Sierra Club, Democracy for America, CREDO, Daily Kos, 350.org, and Presente and Progressives United agreed to either pull their Facebook ad buys or not buy Facebook ads for at least two weeks, in protest of Zuckerberg ads funded by FWD.us that were in support of oil drilling and the Keystone XL pipeline, and in opposition to Obamacare among Republican US senators who back immigration reform.</p>\n<p>On February 13, 2013, Zuckerberg hosted his first ever fundraising event for New Jersey Governor Chris Christie. Zuckerberg's particular interest on this occasion was education reform, and Christie's education reform work focused on teachers unions and the expansion of charter schools. Later that year, Zuckerberg would host a campaign fundraiser for Newark mayor Cory Booker, who was running in the 2013 New Jersey special Senate election. In September 2010, with the support of Governor Chris Christie, Booker obtained a $100 million pledge from Zuckerberg to Newark Public Schools. In December 2012, Zuckerberg donated 18 million shares to the Silicon Valley Community Foundation, a community organization that includes education in its list of grant-making areas.</p>\n<p>On April 11, 2013, Zuckerberg led the launch of a 501(c)(4) lobbying group called FWD.us. The founders and contributors to the group were primarily Silicon Valley entrepreneurs and investors, and its president was Joe Green, a close friend of Zuckerberg. The goals of the group include immigration reform, improving the state of education in the US, and enabling more technological breakthroughs that benefit the public, yet it has also been criticized for financing ads advocating a variety of oil and gas development initiatives, including drilling in the Arctic National Wildlife Refuge and the Keystone XL pipeline.</p>\n<p>A media report on June 20, 2013 revealed that Zuckerberg actively engaged with Facebook users on his own profile page after the online publication of a FWD.us video. In response to a claim that the FWD.us organization is \"just about tech wanting to hire more people\", the Internet entrepreneur replied: \"The bigger problem we’re trying to address is ensuring the 11 million undocumented folks living in this country now and similar folks in the future are treated fairly.\"</p>\n<p>In June 2013, Zuckerberg joined Facebook employees in a company float as part of the annual San Francisco Lesbian, Gay, Bisexual, and Transgender Pride Celebration. The company first participated in the event in 2011, with 70 employees, and this number increased to 700 for the 2013 march. The 2013 pride celebration was especially significant, as it followed a U.S. Supreme Court ruling that deemed the Defense of Marriage Act (DOMA) unconstitutional.</p>\n<p>When questioned about the mid-2013 PRISM scandal at the TechCrunch Disrupt conference in September 2013, Zuckerberg stated that the U.S. government \"blew it.\" He further explained that the government performed poorly in regard to the protection of the freedoms of its citizens, the economy, and companies.</p>\n<h2>§<span id=\"Personal_life\">Personal life</span></h2>\n<p>At a party put on by his fraternity during his sophomore year, Zuckerberg met Priscilla Chan, a fellow student whom he began dating in 2003. Chan is the daughter of Chinese-Vietnamese refugees, who arrived in the U.S. after the Fall of Saigon. She was born in Braintree, Massachusetts, a suburb of Boston, and is a 2003 graduate of Quincy High School.</p>\n<p>In September 2010, Zuckerberg invited Chan, by then a medical student at the University of California, San Francisco, to move into his rented Palo Alto house. Zuckerberg studied Mandarin in preparation for the couple's visit to the People's Republic of China in December 2010. On May 19, 2012, Zuckerberg and Chan married in Zuckerberg's backyard in an event that also celebrated her graduation from medical school.</p>\n<p>In December 2014, Zuckerberg revealed to the public that he continues to study Mandarin. He also said that he enjoys fried chicken pizza, takes his New Year's resolutions seriously, and is learning how to cook.</p>\n<h2>§<span id=\"See_also\">See also</span></h2>\n\n<ul><li>Criticism of Facebook</li>\n<li>Mark Zuckerberg book club</li>\n</ul><h2>§<span id=\"References\">References</span></h2>\n\n<h2>§<span id=\"External_links\">External links</span></h2>\n<ul><li>Profile at <i>Forbes</i></li>\n<li>Appearances on C-SPAN</li>\n<li>Mark Zuckerberg at the Internet Movie Database</li>\n<li>Mark Zuckerberg collected news and commentary at <i>The New York Times</i></li>\n<li>Mark Zuckerberg collected news and commentary at <i>The Wall Street Journal</i></li>\n<li>Mark Zuckerberg collected news and commentary at <i>Bloomberg News</i></li>\n</ul><dl><dt>Interviews</dt>\n</dl><ul><li>Video of interview, Leslie Stahl, <i>Sixty Minutes</i> Dec. 5, 2010</li>\n<li>Video of Interview, Rick Stengel, <i>Time Magazine</i> <i>December 2010</i></li>\n</ul>"}}}}